#Oberon‐0 语言

本实验的处理对象是 Oberon-0 语言，该语言中包含了高级程序设计语言的表达式，以及结构化程序设
计中的结构化控制结构、子程序、参数传递等机制的抽象。<br>

##1简介

用于编译原理实验的计算机语言应足够简单，但又不失其代表性。据此，本实验项目选择了 Oberon-0
语言为处理对象。<br>

Oberon-0 的来历可追溯到近 50 年前， 在此期间的程序设计语言发展约每 10 年就有一标志性成果。 1960
年， P. Naur 等人设计了 Algol 60 语言；约 10 年后，随着结构化程序设计思想的成熟， N. Wirth 设计出
远比 Algol 68 语言成功（特别是在教育界）的 Pascal 语言；又一个 10 年过去， N. Wirth 根据程序设计
和软件工程技术的最新进展，在 Pascal 基础上设计了 Modula-2 语言；又过了约 10 年后， M. Reiser 与
N. Wirth 一起，将 Pascal 语言和 Modula-2 语言的程序设计本质精华浓缩为 Oberon 语言。<br>

Oberon-0 语言是 Oberon 语言的一个子集，为程序员提供了良好的程序结构。在 Oberon-0 程序中，最基
本的语句是赋值语句；复合语句支持顺序、条件（ `if` 语句）和迭代（ `while` 语句）执行。 Oberon-0 中
还支持子程序这一重要概念，包括过程声明和过程调用两个范畴，并且提供了两种不同的参数传递方式：
按值调用（值参数）和按引用调用（可变参数）。<br>

然而 Oberon-0 的类型系统却十分简洁，仅有的基本数据类型是整数类型（ `INTEGER`）和布尔类型
（ `BOOLEAN`），因而可声明整数类型的常量和变量，也允许用算术运算符构造表达式；而表达式的比较
运算则产生 `BOOLEAN` 类型的值，并可用于逻辑运算。 Oberon-0 的复合数据类型包括数组和记录，且允
许任意嵌套；但最基本的指针类型或引用类型就被省略了。<br>

一个过程代表了由语句组成的功能单元，因而在一个过程的写法中自然会关系到名字的局部性
（ Locality）问题。 Oberon-0 语言支持将标识符声明为局部于某一过程，即仅在该过程本身范围内标识
符才是可见的或合法的。<br>

由 N. Wirth 本人编著的 Theory and Techniques of Compiler Construction: An Introduction（ Addison-Wesley,
1996, ISBN 0-201-40353-6，本课程教学网站提供了该教材的电子版）中，第 6 章描述了 Oberon-0 程序
设计语言的语法并给出一个样板程序。本文档的语法定义和例子程序即源于该教材，但作了少数改动，
因而本实验处理的 Oberon-0 语言应以本文档的定义为准。<br>

##2 词法定义

Oberon-0 语言定义了非常简单的语法规则。

###2.1 单词

与我们熟悉的 C、 C++、 Java 等语言不同， Oberon-0 语言是大小写无关的。 譬如， 保留字 `WHILE`、 `While`
和 `while` 三种写法是等价的；而标识符 `BALANCE`、 `Balance` 和 `balance` 是相同的标识符。<br>

Oberon-0 的标识符长度不允许超过 24 个字符（允许 24 个字符）。<br>

在 Oberon-0 中还支持括号风格的注释，在“ (*”和“ *)”之间的内容全部为注释；注意， Oberon-0 注
释不允许嵌套。<br>

###2.2基本数据类型

在 Oberon-0 程序中仅支持 `INTEGER` 和 `BOOLEAN` 两种基本数据类型，可以利用 `VAR` 声明这两种类型的
变量。<br>

`INTEGER` 类型的常量书写形式只允许 Pascal 语言的无符号整数；这些常量可以由 0 开头，但解释为八
进制常量（此时常量中不允许出现 8 和 9 两个数字），非 0 开头则解释为十进制常量。无论十进制还是
八进制整数常量，每一常量中包含数字（包括 0）的个数不可超过 12 个（从而限制了整数常量允许表
达范围的最大值）。<br>

`INTEGER` 类型常量与标识符之前必须以空白符号分隔；例如，扫描 25id 时应作为一个非法整数常量
处理，而不是理解为常量 25 和标识符 id 两个单词。注意，不支持书写 `BOOLEAN` 类型的常量 `TRUE`
和 `FALSE`。<br>

##3 语法定义

本小节以 EBNF 定义了 Oberon-0 语言的形式语法。<br>

###3.1 扩展BNF（EBNF）

EBNF 意即扩展的 BNF（ Extended BNF），是我们在实际应用中定义一门计算机语言的形式语法的国际
标准，参见 ISO/IEC 14977: 1996(E). The Standard Metalanguage Extended BNF。<br>

###3.2 Oberon-0 语言的 EBNF 定义

```
   module = "MODULE" identifier ";"
            	declarations```
            ["BEGIN"
				statement_sequence]
            "END" identifier "." ;
```